---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.Invalid
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.Invalid

Special (reserved) type. This should be non-initialized value of any variable of FailureResolutionType,
 end user should not see this value, API programmer could use this in initialization and comparison.